bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA16A.xml
<?xml version="1.0" encoding="UTF-8"?>
<part-description-file>
    <variants>
        <variant ordercode="ATmega16A-AU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="TQFPQFN44"
                 package="TQFP44" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega16A-PU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="PDIP40"
                 package="PDIP40" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega16A-MU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="TQFPQFN44"
                 package="QFN44" vccmin="2.7" vccmax="5.5"/>
    </variants>
    <devices>
        <device name="ATmega16A" architecture="AVR8" family="megaAVR">
            <address-spaces>
                <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x4000">
                    <memory-segment start="0x0000" size="0x4000" type="flash" rw="RW" exec="1" name="FLASH"
                                    pagesize="0x80"/>
                    <memory-segment start="0x3f00" size="0x0100" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1"
                                    pagesize="0x80"/>
                    <memory-segment start="0x3e00" size="0x0200" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2"
                                    pagesize="0x80"/>
                    <memory-segment start="0x3c00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3"
                                    pagesize="0x80"/>
                    <memory-segment start="0x3800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4"
                                    pagesize="0x80"/>
                </address-space>
                <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                    <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
                </address-space>
                <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0002">
                    <memory-segment start="0" size="0x0002" type="fuses" rw="RW" exec="0" name="FUSES"/>
                </address-space>
                <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                    <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
                </address-space>
                <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0460">
                    <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                    <memory-segment name="MAPPED_IO" start="0x0020" size="0x0040" type="io" external="false"/>
                    <memory-segment name="IRAM" start="0x0060" size="0x0400" type="ram" external="false"/>
                </address-space>
                <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0200">
                    <memory-segment start="0x0000" size="0x0200" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                    pagesize="0x04"/>
                </address-space>
                <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
                <address-space endianness="little" name="osccal" id="osccal" start="0" size="4">
                    <memory-segment start="0" size="4" type="osccal" rw="R" exec="0" name="OSCCAL"/>
                </address-space>
            </address-spaces>
            <peripherals>
                <module name="TC8">
                    <instance name="TC0" caption="Timer/Counter, 8-bit">
                        <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 8-bit"/>
                        <signals>
                            <signal group="OC" function="default" pad="PB3"/>
                            <signal group="T" function="default" pad="PB0"/>
                        </signals>
                    </instance>
                </module>
                <module name="TC16">
                    <instance name="TC1" caption="Timer/Counter, 16-bit">
                        <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                        <signals>
                            <signal group="T" function="default" pad="PB1"/>
                            <signal group="ICP" function="default" pad="PD6"/>
                            <signal group="OCA" function="default" pad="PD5"/>
                            <signal group="OCB" function="default" pad="PD4"/>
                        </signals>
                    </instance>
                </module>
                <module name="EXINT">
                    <instance name="EXINT" caption="External Interrupts">
                        <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                        caption="External Interrupts"/>
                        <signals>
                            <signal group="INT" index="2" function="default" pad="PB2"/>
                            <signal group="INT" index="1" function="default" pad="PD3"/>
                            <signal group="INT" index="0" function="default" pad="PD2"/>
                        </signals>
                    </instance>
                </module>
                <module name="EEPROM">
                    <instance name="EEPROM" caption="EEPROM">
                        <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"
                                        caption="EEPROM"/>
                    </instance>
                </module>
                <module name="CPU">
                    <instance name="CPU" caption="CPU Registers">
                        <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                        caption="CPU Registers"/>
                        <parameters>
                            <param name="CORE_VERSION" value="V2E"/>
                        </parameters>
                    </instance>
                </module>
