bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA16A.xml
                <module name="TC8_ASYNC">
                    <instance name="TC2" caption="Timer/Counter, 8-bit Async">
                        <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 8-bit Async"/>
                        <signals>
                            <signal group="TOSC" index="2" function="default" pad="PC7"/>
                            <signal group="TOSC" index="1" function="default" pad="PC6"/>
                            <signal group="OC" function="default" pad="PD7"/>
                        </signals>
                    </instance>
                </module>
                <module name="SPI">
                    <instance name="SPI" caption="Serial Peripheral Interface">
                        <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data"
                                        caption="Serial Peripheral Interface"/>
                        <signals>
                            <signal group="SCK" function="default" pad="PB7"/>
                            <signal group="MISO" function="default" pad="PB6"/>
                            <signal group="MOSI" function="default" pad="PB5"/>
                            <signal group="SS" function="default" pad="PB4"/>
                        </signals>
                    </instance>
                </module>
                <module name="USART">
                    <instance name="USART" caption="USART">
                        <register-group name="USART" name-in-module="USART" offset="0x00" address-space="data"
                                        caption="USART"/>
                        <signals>
                            <signal group="XCK" function="default" pad="PB0"/>
                            <signal group="TXD" function="default" pad="PD1"/>
                            <signal group="RXD" function="default" pad="PD0"/>
                        </signals>
                    </instance>
                </module>
                <module name="TWI">
                    <instance name="TWI" caption="Two Wire Serial Interface">
                        <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data"
                                        caption="Two Wire Serial Interface"/>
                        <signals>
                            <signal group="SDA" function="default" pad="PC1"/>
                            <signal group="SCL" function="default" pad="PC0"/>
                        </signals>
                    </instance>
                </module>
                <module name="AC">
                    <instance name="AC" caption="Analog Comparator">
                        <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                        caption="Analog Comparator"/>
                        <signals>
                            <signal group="AIN" index="0" function="default" pad="PB2"/>
                            <signal group="AIN" index="1" function="default" pad="PB3"/>
                        </signals>
                    </instance>
                </module>
                <module name="ADC">
                    <instance name="ADC" caption="Analog-to-Digital Converter">
                        <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"
                                        caption="Analog-to-Digital Converter"/>
                        <signals>
                            <signal group="ADC" index="0" function="default" pad="PA0"/>
                            <signal group="ADC" index="1" function="default" pad="PA1"/>
                            <signal group="ADC" index="2" function="default" pad="PA2"/>
                            <signal group="ADC" index="3" function="default" pad="PA3"/>
                            <signal group="ADC" index="4" function="default" pad="PA4"/>
                            <signal group="ADC" index="5" function="default" pad="PA5"/>
                            <signal group="ADC" index="6" function="default" pad="PA6"/>
                            <signal group="ADC" index="7" function="default" pad="PA7"/>
                        </signals>
                    </instance>
                </module>
                <module name="JTAG">
                    <instance name="JTAG" caption="JTAG Interface">
                        <register-group name="JTAG" name-in-module="JTAG" offset="0x00" address-space="data"
                                        caption="JTAG Interface"/>
                        <signals>
                            <signal group="TDI" function="default" pad="PC5"/>
                            <signal group="TDO" function="default" pad="PC4"/>
                            <signal group="TMS" function="default" pad="PC3"/>
                            <signal group="TCK" function="default" pad="PC2"/>
                        </signals>
                    </instance>
                </module>
                <module name="BOOT_LOAD">
                    <instance name="BOOT_LOAD" caption="Bootloader">
                        <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data"
                                        caption="Bootloader"/>
                    </instance>
                </module>
                <module name="PORT">
                    <instance name="PORTA" caption="I/O Port">
                        <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PA0" index="0"/>
                            <signal group="P" function="default" pad="PA1" index="1"/>
                            <signal group="P" function="default" pad="PA2" index="2"/>
                            <signal group="P" function="default" pad="PA3" index="3"/>
                            <signal group="P" function="default" pad="PA4" index="4"/>
                            <signal group="P" function="default" pad="PA5" index="5"/>
                            <signal group="P" function="default" pad="PA6" index="6"/>
                            <signal group="P" function="default" pad="PA7" index="7"/>
                        </signals>
                    </instance>
                    <instance name="PORTB" caption="I/O Port">
                        <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PB0" index="0"/>
                            <signal group="P" function="default" pad="PB1" index="1"/>
                            <signal group="P" function="default" pad="PB2" index="2"/>
                            <signal group="P" function="default" pad="PB3" index="3"/>
                            <signal group="P" function="default" pad="PB4" index="4"/>
                            <signal group="P" function="default" pad="PB5" index="5"/>
                            <signal group="P" function="default" pad="PB6" index="6"/>
                            <signal group="P" function="default" pad="PB7" index="7"/>
                        </signals>
                    </instance>
                    <instance name="PORTC" caption="I/O Port">
                        <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PC0" index="0"/>
                            <signal group="P" function="default" pad="PC1" index="1"/>
                            <signal group="P" function="default" pad="PC2" index="2"/>
                            <signal group="P" function="default" pad="PC3" index="3"/>
                            <signal group="P" function="default" pad="PC4" index="4"/>
                            <signal group="P" function="default" pad="PC5" index="5"/>
                            <signal group="P" function="default" pad="PC6" index="6"/>
                            <signal group="P" function="default" pad="PC7" index="7"/>
                        </signals>
                    </instance>
                    <instance name="PORTD" caption="I/O Port">
                        <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PD0" index="0"/>
                            <signal group="P" function="default" pad="PD1" index="1"/>
                            <signal group="P" function="default" pad="PD2" index="2"/>
                            <signal group="P" function="default" pad="PD3" index="3"/>
                            <signal group="P" function="default" pad="PD4" index="4"/>
                            <signal group="P" function="default" pad="PD5" index="5"/>
                            <signal group="P" function="default" pad="PD6" index="6"/>
                            <signal group="P" function="default" pad="PD7" index="7"/>
                        </signals>
                    </instance>
                </module>
                <module name="WDT">
                    <instance name="WDT" caption="Watchdog Timer">
                        <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                        caption="Watchdog Timer"/>
                    </instance>
                </module>
                <module name="FUSE">
                    <instance name="FUSE" caption="Fuses">
                        <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"
                                        caption="Fuses"/>
                    </instance>
                </module>
