bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA16A.xml
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="JTAG Interface" name="JTAG">
            <register-group caption="JTAG Interface" name="JTAG">
                <register caption="On-Chip Debug Related Register in I/O Memory" name="OCDR" offset="0x51" size="1"
                          ocd-rw="">
                    <bitfield caption="On-Chip Debug Register Bits" mask="0xFF" name="OCDR"/>
                </register>
                <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                </register>
            </register-group>
        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port A Data Register" name="PORTA" offset="0x3B" size="1" mask="0xFF"/>
                <register caption="Port A Data Direction Register" name="DDRA" offset="0x3A" size="1" mask="0xFF"/>
                <register caption="Port A Input Pins" name="PINA" offset="0x39" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTB">
                <register caption="Port B Data Register" name="PORTB" offset="0x38" size="1" mask="0xFF"/>
                <register caption="Port B Data Direction Register" name="DDRB" offset="0x37" size="1" mask="0xFF"/>
                <register caption="Port B Input Pins" name="PINB" offset="0x36" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTC">
                <register caption="Port C Data Register" name="PORTC" offset="0x35" size="1" mask="0xFF"/>
                <register caption="Port C Data Direction Register" name="DDRC" offset="0x34" size="1" mask="0xFF"/>
                <register caption="Port C Input Pins" name="PINC" offset="0x33" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTD">
                <register caption="Port D Data Register" name="PORTD" offset="0x32" size="1" mask="0xFF"/>
                <register caption="Port D Data Direction Register" name="DDRD" offset="0x31" size="1" mask="0xFF"/>
                <register caption="Port D Input Pins" name="PIND" offset="0x30" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x41" size="1">
                    <bitfield caption="RW" mask="0x10" name="WDTOE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                    <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP"
                              values="WDOG_TIMER_PRESCALE_3BITS"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_3BITS">
                <value caption="Oscillator Cycles 16K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 2048K" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="TQFPQFN44" caption="TQFPQFN44">
            <pin position="1" pad="PB5"/>
            <pin position="2" pad="PB6"/>
            <pin position="3" pad="PB7"/>
            <pin position="4" pad="RESET"/>
            <pin position="5" pad="VCC"/>
            <pin position="6" pad="GND"/>
            <pin position="7" pad="XTAL2"/>
            <pin position="8" pad="XTAL1"/>
            <pin position="9" pad="PD0"/>
            <pin position="10" pad="PD1"/>
            <pin position="11" pad="PD2"/>
            <pin position="12" pad="PD3"/>
            <pin position="13" pad="PD4"/>
            <pin position="14" pad="PD5"/>
            <pin position="15" pad="PD6"/>
            <pin position="16" pad="PD7"/>
            <pin position="17" pad="VCC"/>
            <pin position="18" pad="GND"/>
            <pin position="19" pad="PC0"/>
            <pin position="20" pad="PC1"/>
            <pin position="21" pad="PC2"/>
            <pin position="22" pad="PC3"/>
            <pin position="23" pad="PC4"/>
            <pin position="24" pad="PC5"/>
            <pin position="25" pad="PC6"/>
            <pin position="26" pad="PC7"/>
            <pin position="27" pad="AVCC"/>
            <pin position="28" pad="GND"/>
            <pin position="29" pad="AREF"/>
            <pin position="30" pad="PA7"/>
            <pin position="31" pad="PA6"/>
            <pin position="32" pad="PA5"/>
            <pin position="33" pad="PA4"/>
            <pin position="34" pad="PA3"/>
            <pin position="35" pad="PA2"/>
            <pin position="36" pad="PA1"/>
            <pin position="37" pad="PA0"/>
            <pin position="38" pad="VCC"/>
            <pin position="39" pad="GND"/>
            <pin position="40" pad="PB0"/>
            <pin position="41" pad="PB1"/>
            <pin position="42" pad="PB2"/>
            <pin position="43" pad="PB3"/>
            <pin position="44" pad="PB4"/>
        </pinout>
        <pinout name="PDIP40" caption="PDIP40">
            <pin position="1" pad="PB0"/>
            <pin position="2" pad="PB1"/>
            <pin position="3" pad="PB2"/>
            <pin position="4" pad="PB3"/>
            <pin position="5" pad="PB4"/>
            <pin position="6" pad="PB5"/>
            <pin position="7" pad="PB6"/>
            <pin position="8" pad="PB7"/>
            <pin position="9" pad="RESET"/>
            <pin position="10" pad="VCC"/>
            <pin position="11" pad="GND"/>
            <pin position="12" pad="XTAL2"/>
            <pin position="13" pad="XTAL1"/>
            <pin position="14" pad="PD0"/>
            <pin position="15" pad="PD1"/>
            <pin position="16" pad="PD2"/>
            <pin position="17" pad="PD3"/>
            <pin position="18" pad="PD4"/>
            <pin position="19" pad="PD5"/>
            <pin position="20" pad="PD6"/>
            <pin position="21" pad="PD7"/>
            <pin position="22" pad="PC0"/>
            <pin position="23" pad="PC1"/>
            <pin position="24" pad="PC2"/>
            <pin position="25" pad="PC3"/>
            <pin position="26" pad="PC4"/>
            <pin position="27" pad="PC5"/>
            <pin position="28" pad="PC6"/>
            <pin position="29" pad="PC7"/>
            <pin position="30" pad="AVCC"/>
            <pin position="31" pad="GND"/>
            <pin position="32" pad="AREF"/>
            <pin position="33" pad="PA7"/>
            <pin position="34" pad="PA6"/>
            <pin position="35" pad="PA5"/>
            <pin position="36" pad="PA4"/>
            <pin position="37" pad="PA3"/>
            <pin position="38" pad="PA2"/>
            <pin position="39" pad="PA1"/>
            <pin position="40" pad="PA0"/>
        </pinout>
    </pinouts>
</part-description-file>